---
kind: type
id: T:Autodesk.Revit.DB.DisableAnalyticalModelCB
source: html/110d83e4-9009-46bb-f956-297c7843b590.htm
---
# Autodesk.Revit.DB.DisableAnalyticalModelCB

Disable the analytical model for a structural wall.

## Syntax (C#)
```csharp
public class DisableAnalyticalModelCB : FailureResolution
```